app/views/comments/_index.html.erb

<u1>
  <% if @post.comments.size < 2 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1