app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def load_post
  @post = Post.find(params[:post_id])

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @comment = @post.comments.find(params[:id])

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @comment = @post.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @comment = @post.comments.find(params[:id])
    @comment.destroy